#+TITLE:  Learning Genetic Algorithms
#+AUTHOR: Lucas Vieira
#+EMAIL:  lucasvieira@lisp.com.br
#+DATE:   Dec 27, 2018
#+PROPERTY: header-args:lisp :cache yes :exports code :tangle yes
#+STARTUP:  showall

*** Example: Checking zygote generation

Here is an example of what happens when you print an immediately created
proto. The first line is the actual value of the 32-bit integer, and the second
line is the binary representation of such integer, when you call
~print-chromosome~ using its value.

#+BEGIN_SRC lisp :tangle no :results output :exports results
(let ((proto (make-proto)))
  (princ proto)
  (terpri)
  (print-chromosome proto))
#+END_SRC

#+RESULTS[6f401c2e0564b3ce48b862f0808b67dd0f28e0a5]:
: 270663680
: 00010000001000100000000000000000



** Example: Checking generated population

We can use ~mapc~ along with ~print-chromosome-with-fitness~ to beautifully print
all of our generated specimen, and each chromosome's fitness. Here is an
example.

#+BEGIN_SRC lisp :tangle no :results output :exports both
;; Initialize a population first
(initialize-population)

(mapc #'print-chromosome-with-fitness *population*)
#+END_SRC

#+RESULTS[6699be12ce2485d9c7e4d3df1207ee473484e318]:
#+begin_example
00000001010000010000000000000100 => 4
01000000100100010000000000100000 => 5
00000010110100000000000010000000 => 5
00000000000101010000100000000000 => 4
00010110001000010000000100000000 => 6
00001010001000010001000000000000 => 5
10010001100000100000100000000000 => 6
00000011110010000000001000000000 => 6
01011000110100000000000100000000 => 7
01010000001011110000000001000000 => 8
#+end_example

** Example: Checking selected chromosomes

Using the same principle of printing the population, we can do the same with
~*fittest*~, which is the variable storing the two fittest individuals. This time,
though, their fitness values are irrelevant, so passing ~print-chromosome~ over
each one with the aid of ~mapc~ should do the trick.

#+BEGIN_SRC lisp :tangle no :results output :exports both
(mapc #'print-chromosome *fittest*)
#+END_SRC

#+RESULTS[5466a80ea4296031a65338e39644bbd3dccf3f8b]:
: 01111111111101100001010010011111
: 01111101111101110001010010001011

** Example: Testing the mutation algorithm

We can check whether this is working or not with a simple algorithm which
generates a chromosome and its mutation; then, we just print them and see if
they can be compared. By re-running it a couple of times, we should see a
mutated gene here and there.

#+BEGIN_SRC lisp :tangle no :results output :exports both
(let ((chromosome (make-chromosome)))
  (mapc #'print-chromosome
	(list chromosome (mutate chromosome))))
#+END_SRC

#+RESULTS[fdd4c70eadbd01927098993522c2c960065db314]:
: 00110010000000000000001000000000
: 00110010000000001000000001000000

* Conclusion

With everything all sorted and done, we can test our algorithm at once. Here's
one possible output when running the function ~run-genetic-algorithm~:

#+BEGIN_SRC lisp :tangle no :exports results :results output
(run-genetic-algorithm)
#+END_SRC

#+RESULTS[32db23317bf915961623d386c29ac67e9b73aca1]:
#+begin_example
Generation: 0
Fittest:
00010010010011110001000000000000
01011010010100010000000000001000

Generation: 1
Fittest:
00010010010011110001000000000000
01011010010100010000000000001000

Generation: 2
Fittest:
01011110100100010001000101000000
00010010010011110001000000000000

Generation: 3
Fittest:
00011010011011110001000101000000
01011110100100010001000101000000

Generation: 4
Fittest:
00111010010111110000001101000000
00011010011011110001000101000000

Generation: 5
Fittest:
00111010010111110000001101000000
00011010011011110001000101000000

Generation: 6
Fittest:
00111010010111110000001101000000
00111010010111110001000101000000

Generation: 7
Fittest:
10111010010111110001100101000000
00111010010111111000001101100000

Generation: 8
Fittest:
10111010010111110001100101000000
00111010010111111000001101100000

Generation: 9
Fittest:
10111010010111110001100101000000
00111010010111111000001101100000

Generation: 10
Fittest:
10111010010111110001100101000000
00111010010111111000001101100000

Generation: 11
Fittest:
10110010010111111010101101101001
10111010010111110001100101000000

Population converged.
Best fitness: 22

Final population:
10111110010111111010101101101011 => 22
10110010010111110001100101000000 => 14
10110010010111111010101101101001 => 19
00011010010111110001000101000100 => 13
00111010010111110100001001100000 => 14
00111010010111111000001101100000 => 15
10111010010111110001100101000000 => 15
10011000011011110000001101001000 => 13
00111010010111110001000101000000 => 13
00111010010111110000001101000000 => 13

#+end_example

